mkj/imxrt-pacs/svd/MIMXRT1042.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EWM</name>
      <description>EWM</description>
      <groupName>EWM</groupName>
      <baseAddress>0x400B4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EWM</name>
        <value>94</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>EWMEN</name>
              <description>EWM enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>EWM module is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>EWM module is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASSIN</name>
              <description>EWM_in's Assertion State Select.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Default assert state of the EWM_in signal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Inverts the assert state of EWM_in signal.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEN</name>
              <description>Input Enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>EWM_in port is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>EWM_in port is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTEN</name>
              <description>Interrupt Enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Deasserts the interrupt request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_REQ</name>
                  <description>Generates an interrupt request, when EWM_OUT_b is asserted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SERV</name>
          <description>Service Register</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SERVICE</name>
              <description>SERVICE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPL</name>
          <description>Compare Low Register</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <access>read-writeOnce</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>COMPAREL</name>
              <description>COMPAREL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPH</name>
          <description>Compare High Register</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <access>read-writeOnce</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>COMPAREH</name>
              <description>COMPAREH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKCTRL</name>
          <description>Clock Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-writeOnce</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>CLKSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKPRESCALER</name>
          <description>Clock Prescaler Register</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <access>read-writeOnce</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CLK_DIV</name>
              <description>CLK_DIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-writeOnce</access>
            </field>
          </fields>
        </register>
