mkj/imxrt-pacs/svd/MIMXRT1042.svd
        <register>
          <name>MB2_32B_WORD4_L</name>
          <description>Message Buffer 2 WORD_32B Register</description>
          <alternateGroup>MB_SIZE</alternateGroup>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_19</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_18</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_17</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_16</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB4_16B_WORD0_L</name>
          <description>Message Buffer 4 WORD_16B Register</description>
          <alternateGroup>MB_SIZE</alternateGroup>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_3</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_2</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_1</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_0</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB6_8B_WORD0</name>
          <description>Message Buffer 6 WORD_8B Register</description>
          <alternateGroup>MB_SIZE</alternateGroup>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_3</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_2</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_1</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_0</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WORD06</name>
          <description>Message Buffer 6 WORD0 Register</description>
          <alternateGroup>MB_SIZE</alternateGroup>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_3</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_2</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_1</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_0</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB1_64B_WORD7_L</name>
          <description>Message Buffer 1 WORD_64B Register</description>
          <alternateGroup>MB_SIZE</alternateGroup>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_31</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_30</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_29</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_28</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB2_32B_WORD5_L</name>
          <description>Message Buffer 2 WORD_32B Register</description>
          <alternateGroup>MB_SIZE</alternateGroup>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_23</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_22</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_21</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_20</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB4_16B_WORD1_L</name>
          <description>Message Buffer 4 WORD_16B Register</description>
          <alternateGroup>MB_SIZE</alternateGroup>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_7</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_6</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_5</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_4</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB6_8B_WORD1</name>
          <description>Message Buffer 6 WORD_8B Register</description>
          <alternateGroup>MB_SIZE</alternateGroup>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_7</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_6</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_5</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_4</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WORD16</name>
          <description>Message Buffer 6 WORD1 Register</description>
          <alternateGroup>MB_SIZE</alternateGroup>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_7</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_6</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_5</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_4</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CS7</name>
          <description>Message Buffer 7 CS Register</description>
          <alternateGroup>MB_SIZE</alternateGroup>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIME_STAMP</name>
              <description>Free-Running Counter Time stamp. This 16-bit field is a copy of the Free-Running Timer, captured for Tx and Rx frames at the time when the beginning of the Identifier field appears on the CAN bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLC</name>
              <description>Length of the data to be stored/transmitted.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTR</name>
              <description>Remote Transmission Request. One/zero for remote/data frame.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDE</name>
              <description>ID Extended. One/zero for extended/standard format frame.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRR</name>
              <description>Substitute Remote Request. Contains a fixed recessive bit.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CODE</name>
              <description>Message Buffer Code. This 4-bit field can be accessed (read or write) by the CPU and by the FlexCAN module itself, as part of the message buffer matching and arbitration process.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESI</name>
              <description>Error State Indicator. This bit indicates if the transmitting node is error active or error passive.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRS</name>
              <description>Bit Rate Switch. This bit defines whether the bit rate is switched inside a CAN FD format frame.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDL</name>
              <description>Extended Data Length. This bit distinguishes between CAN format and CAN FD format frames. The EDL bit must not be set for Message Buffers configured to RANSWER with code field 0b1010.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB1_64B_WORD8_L</name>
          <description>Message Buffer 1 WORD_64B Register</description>
          <alternateGroup>MB_SIZE</alternateGroup>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_35</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_34</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_33</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_32</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB2_32B_WORD6_L</name>
          <description>Message Buffer 2 WORD_32B Register</description>
          <alternateGroup>MB_SIZE</alternateGroup>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_27</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_26</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_25</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_24</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB4_16B_WORD2_L</name>
          <description>Message Buffer 4 WORD_16B Register</description>
          <alternateGroup>MB_SIZE</alternateGroup>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_11</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_10</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_9</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_8</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
