mkj/imxrt-pacs/svd/MIMXRT1042.svd
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_B1_03</name>
          <description>SW_MUX_CTL_PAD_GPIO_B1_03 SW MUX Control Register</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: LCD_DATA15 of instance: lcdif</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: XBAR1_INOUT17 of instance: xbar1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>Select mux mode: ALT2 mux port: LPSPI3_PCS1 of instance: lpspi3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: SAI1_TX_SYNC of instance: sai1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO2_FLEXIO19 of instance: flexio2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO2_IO19 of instance: gpio2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6</name>
                  <description>Select mux mode: ALT6 mux port: FLEXPWM2_PWMB03 of instance: flexpwm2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9</name>
                  <description>Select mux mode: ALT9 mux port: FLEXIO3_FLEXIO19 of instance: flexio3</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_B1_03</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_B1_04</name>
          <description>SW_MUX_CTL_PAD_GPIO_B1_04 SW MUX Control Register</description>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: LCD_DATA16 of instance: lcdif</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: LPSPI3_PCS0 of instance: lpspi3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: ENET_RX_DATA00 of instance: enet</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO2_FLEXIO20 of instance: flexio2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO2_IO20 of instance: gpio2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8</name>
                  <description>Select mux mode: ALT8 mux port: GPT1_CLK of instance: gpt1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9</name>
                  <description>Select mux mode: ALT9 mux port: FLEXIO3_FLEXIO20 of instance: flexio3</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_B1_04</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_B1_05</name>
          <description>SW_MUX_CTL_PAD_GPIO_B1_05 SW MUX Control Register</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: LCD_DATA17 of instance: lcdif</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: LPSPI3_SDI of instance: lpspi3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: ENET_RX_DATA01 of instance: enet</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO2_FLEXIO21 of instance: flexio2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO2_IO21 of instance: gpio2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8</name>
                  <description>Select mux mode: ALT8 mux port: GPT1_CAPTURE1 of instance: gpt1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9</name>
                  <description>Select mux mode: ALT9 mux port: FLEXIO3_FLEXIO21 of instance: flexio3</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_B1_05</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_B1_06</name>
          <description>SW_MUX_CTL_PAD_GPIO_B1_06 SW MUX Control Register</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: LCD_DATA18 of instance: lcdif</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: LPSPI3_SDO of instance: lpspi3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: ENET_RX_EN of instance: enet</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO2_FLEXIO22 of instance: flexio2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO2_IO22 of instance: gpio2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8</name>
                  <description>Select mux mode: ALT8 mux port: GPT1_CAPTURE2 of instance: gpt1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9</name>
                  <description>Select mux mode: ALT9 mux port: FLEXIO3_FLEXIO22 of instance: flexio3</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_B1_06</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_B1_07</name>
          <description>SW_MUX_CTL_PAD_GPIO_B1_07 SW MUX Control Register</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: LCD_DATA19 of instance: lcdif</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: LPSPI3_SCK of instance: lpspi3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: ENET_TX_DATA00 of instance: enet</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO2_FLEXIO23 of instance: flexio2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO2_IO23 of instance: gpio2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8</name>
                  <description>Select mux mode: ALT8 mux port: GPT1_COMPARE1 of instance: gpt1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9</name>
                  <description>Select mux mode: ALT9 mux port: FLEXIO3_FLEXIO23 of instance: flexio3</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_B1_07</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_B1_08</name>
          <description>SW_MUX_CTL_PAD_GPIO_B1_08 SW MUX Control Register</description>
          <addressOffset>0x19C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: LCD_DATA20 of instance: lcdif</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: QTIMER1_TIMER3 of instance: qtimer1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: ENET_TX_DATA01 of instance: enet</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO2_FLEXIO24 of instance: flexio2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO2_IO24 of instance: gpio2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6</name>
                  <description>Select mux mode: ALT6 mux port: FLEXCAN2_TX of instance: flexcan2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8</name>
                  <description>Select mux mode: ALT8 mux port: GPT1_COMPARE2 of instance: gpt1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9</name>
                  <description>Select mux mode: ALT9 mux port: FLEXIO3_FLEXIO24 of instance: flexio3</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_B1_08</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
