mkj/imxrt-pacs/svd/MIMXRT1042.svd
        <register>
          <name>LPI2C4_SCL_SELECT_INPUT</name>
          <description>LPI2C4_SCL_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x4E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_12_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_12 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B0_12_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_B0_12 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPI2C4_SDA_SELECT_INPUT</name>
          <description>LPI2C4_SDA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x4E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_11_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_11 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B0_13_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_B0_13 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI1_PCS0_SELECT_INPUT</name>
          <description>LPSPI1_PCS0_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x4EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B0_01_ALT4</name>
                  <description>Selecting Pad: GPIO_SD_B0_01 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_30_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_30 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI1_SCK_SELECT_INPUT</name>
          <description>LPSPI1_SCK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x4F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_27_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_27 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B0_00_ALT4</name>
                  <description>Selecting Pad: GPIO_SD_B0_00 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI1_SDI_SELECT_INPUT</name>
          <description>LPSPI1_SDI_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x4F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_29_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_29 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B0_03_ALT4</name>
                  <description>Selecting Pad: GPIO_SD_B0_03 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI1_SDO_SELECT_INPUT</name>
          <description>LPSPI1_SDO_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x4F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_28_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_28 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B0_02_ALT4</name>
                  <description>Selecting Pad: GPIO_SD_B0_02 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI2_PCS0_SELECT_INPUT</name>
          <description>LPSPI2_PCS0_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x4FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_06_ALT4</name>
                  <description>Selecting Pad: GPIO_SD_B1_06 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_01_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_01 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI2_SCK_SELECT_INPUT</name>
          <description>LPSPI2_SCK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_07_ALT4</name>
                  <description>Selecting Pad: GPIO_SD_B1_07 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_00_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_00 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI2_SDI_SELECT_INPUT</name>
          <description>LPSPI2_SDI_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_09_ALT4</name>
                  <description>Selecting Pad: GPIO_SD_B1_09 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_03_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_03 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI2_SDO_SELECT_INPUT</name>
          <description>LPSPI2_SDO_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_08_ALT4</name>
                  <description>Selecting Pad: GPIO_SD_B1_08 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_02_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_02 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI3_PCS0_SELECT_INPUT</name>
          <description>LPSPI3_PCS0_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x51C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_B0_00_ALT3</name>
                  <description>Selecting Pad: GPIO_B0_00 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_04_ALT1</name>
                  <description>Selecting Pad:GPIO_B1_04 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI3_SCK_SELECT_INPUT</name>
          <description>LPSPI3_SCK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_B0_03_ALT3</name>
                  <description>Selecting Pad: GPIO_B0_03 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_07_ALT1</name>
                  <description>Selecting Pad: GPIO_B1_07 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI3_SDI_SELECT_INPUT</name>
          <description>LPSPI3_SDI_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x524</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_B0_01_ALT3</name>
                  <description>Selecting Pad: GPIO_B0_01 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_05_ALT1</name>
                  <description>Selecting Pad: GPIO_B1_05 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI3_SDO_SELECT_INPUT</name>
          <description>LPSPI3_SDO_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x528</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_B0_02_ALT3</name>
                  <description>Selecting Pad: GPIO_B0_02 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_06_ALT1</name>
                  <description>Selecting Pad: GPIO_B1_06 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART2_RX_SELECT_INPUT</name>
          <description>LPUART2_RX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x52C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_10_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_B1_10 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B1_03_ALT2</name>
                  <description>Selecting Pad: GPIO_AD_B1_03 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART2_TX_SELECT_INPUT</name>
          <description>LPUART2_TX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x530</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_11_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_B1_11 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B1_02_ALT2</name>
                  <description>Selecting Pad: GPIO_AD_B1_02 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART3_CTS_B_SELECT_INPUT</name>
          <description>LPUART3_CTS_B_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x534</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_15_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_15 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B1_04_ALT2</name>
                  <description>Selecting Pad: GPIO_AD_B1_04 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART3_RX_SELECT_INPUT</name>
          <description>LPUART3_RX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x538</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_B1_07_ALT2</name>
                  <description>Selecting Pad: GPIO_AD_B1_07 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_14_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_14 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B0_09_ALT3</name>
                  <description>Selecting Pad: GPIO_B0_09 for Mode: ALT3</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
