mkj/imxrt-pacs/svd/MIMXRT1042.svd
        <register>
          <name>PIGEON_11_0</name>
          <description>Panel Interface Signal Generator Register</description>
          <addressOffset>0xAC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable pigeon Mode on this signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POL</name>
              <description>Polarity of signal output</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE_HIGH</name>
                  <description>Normal Signal (Active high)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE_LOW</name>
                  <description>Inverted signal (Active low)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INC_SEL</name>
              <description>Event to incrment local counter</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCLK</name>
                  <description>pclk</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINE</name>
                  <description>Line start pulse</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME</name>
                  <description>Frame start pulse</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIG_ANOTHER</name>
                  <description>Use another signal as tick event</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFFSET</name>
              <description>offset on pclk unit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_CNT_SEL</name>
              <description>select global counters as mask condition, use together with MASK_CNT</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSTATE_CNT</name>
                  <description>pclk counter within one hscan state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSTATE_CYCLE</name>
                  <description>pclk cycle within one hscan state</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSTATE_CNT</name>
                  <description>line counter within one vscan state</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSTATE_CYCLE</name>
                  <description>line cycle within one vscan state</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_CNT</name>
                  <description>frame counter</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_CYCLE</name>
                  <description>frame cycle</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCNT</name>
                  <description>horizontal counter (pclk counter within one line )</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCNT</name>
                  <description>vertical counter (line counter within one frame)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_CNT</name>
              <description>When the global counter selected through MASK_CNT_SEL matches value in this reg, pigeon local counter start ticking</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STATE_MASK</name>
              <description>state_mask = (FS|FB|FD|FE) and (LS|LB|LD|LE) , select any combination of scan states as reference point for local counter to start ticking</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FS</name>
                  <description>FRAME SYNC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FB</name>
                  <description>FRAME BEGIN</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FD</name>
                  <description>FRAME DATA</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FE</name>
                  <description>FRAME END</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS</name>
                  <description>LINE SYNC</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LB</name>
                  <description>LINE BEGIN</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LD</name>
                  <description>LINE DATA</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LE</name>
                  <description>LINE END</description>
                  <value>0x80</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PIGEON_11_1</name>
          <description>Panel Interface Signal Generator Register</description>
          <addressOffset>0xAD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SET_CNT</name>
              <description>Assert signal output when counter match this value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>START_ACTIVE</name>
                  <description>Start as active</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR_CNT</name>
              <description>Deassert signal output when counter match this value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_USING_MASK</name>
                  <description>Keep active until mask off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PIGEON_11_2</name>
          <description>Panel Interface Signal Generator Register</description>
          <addressOffset>0xAE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIG_LOGIC</name>
              <description>Logic operation with another signal: DIS/AND/OR/COND</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>No logic operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AND</name>
                  <description>sigout = sig_another AND this_sig</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OR</name>
                  <description>sigout = sig_another OR this_sig</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>mask = sig_another AND other_masks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIG_ANOTHER</name>
              <description>Select another signal for logic operation or as mask or counter tick event</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_USING_MASK</name>
                  <description>Keep active until mask off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT_CTRL</name>
          <description>Look Up Table Control Register</description>
          <addressOffset>0xB00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LUT_BYPASS</name>
              <description>Setting this bit will bypass the LUT memory resource completely</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT0_ADDR</name>
          <description>Lookup Table 0 Index Register</description>
          <addressOffset>0xB10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>LUT indexed address pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT0_DATA</name>
          <description>Lookup Table 0 Data Register</description>
          <addressOffset>0xB20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Writing this field will load 4 bytes, aligned to four byte boundaries, of data indexed by the ADDR field of the REG_LUT_CTRL register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1_ADDR</name>
          <description>Lookup Table 1 Index Register</description>
          <addressOffset>0xB30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>LUT indexed address pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1_DATA</name>
          <description>Lookup Table 1 Data Register</description>
          <addressOffset>0xB40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Writing this field will load 4 bytes, aligned to four byte boundaries, of data indexed by the ADDR field of the REG_LUT_CTRL register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
