mkj/imxrt-pacs/svd/MIMXRT1042.svd
        <register>
          <name>SDRAMCR0</name>
          <description>SDRAM Control Register 0</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC26</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PS</name>
              <description>Port Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PS_0</name>
                  <description>8bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PS_1</name>
                  <description>16bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BL</name>
              <description>Burst Length</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BL_0</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_1</name>
                  <description>2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_2</name>
                  <description>4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_3</name>
                  <description>8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_4</name>
                  <description>8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_5</name>
                  <description>8</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_6</name>
                  <description>8</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_7</name>
                  <description>8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COL8</name>
              <description>Column 8 selection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COL8_0</name>
                  <description>Column address bit number is decided by COL field.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL8_1</name>
                  <description>Column address bit number is 8. COL field is ignored.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COL</name>
              <description>Column address bit number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COL_0</name>
                  <description>12</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_1</name>
                  <description>11</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_2</name>
                  <description>10</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_3</name>
                  <description>9</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CL</name>
              <description>CAS Latency</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CL_0</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL_2</name>
                  <description>2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL_3</name>
                  <description>3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK2</name>
              <description>2 Bank selection bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BANK2_0</name>
                  <description>SDRAM device has 4 banks.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK2_1</name>
                  <description>SDRAM device has 2 banks.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SDRAMCR1</name>
          <description>SDRAM Control Register 1</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x994934</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRE2ACT</name>
              <description>PRECHARGE to ACTIVE/REFRESH command wait time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACT2RW</name>
              <description>ACTIVE to READ/WRITE delay</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFRC</name>
              <description>REFRESH recovery time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRC</name>
              <description>WRITE recovery time</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKEOFF</name>
              <description>CKE off minimum time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACT2PRE</name>
              <description>ACTIVE to PRECHARGE minimum time</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDRAMCR2</name>
          <description>SDRAM Control Register 2</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000EEE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRRC</name>
              <description>SELF REFRESH recovery time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF2REF</name>
              <description>REFRESH to REFRESH delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACT2ACT</name>
              <description>ACTIVE to ACTIVE delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITO</name>
              <description>SDRAM idle timeout</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITO_0</name>
                  <description>IDLE timeout period is 256*Prescale period.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_1</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_2</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_3</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_4</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_5</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_6</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_7</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_8</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_9</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SDRAMCR3</name>
          <description>SDRAM Control Register 3</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40808000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REN</name>
              <description>Refresh enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REN_0</name>
                  <description>The SEMC does not send AUTO REFRESH command automatically</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REN_1</name>
                  <description>The SEMC sends AUTO REFRESH command automatically</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REBL</name>
              <description>Refresh burst length</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REBL_0</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_1</name>
                  <description>2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_2</name>
                  <description>3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_3</name>
                  <description>4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_4</name>
                  <description>5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_5</name>
                  <description>6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_6</name>
                  <description>7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_7</name>
                  <description>8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESCALE</name>
              <description>Prescaler period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRESCALE_0</name>
                  <description>(256*16+1) clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_1</name>
                  <description>(PRESCALE*16+1) clock cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_2</name>
                  <description>(PRESCALE*16+1) clock cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_3</name>
                  <description>(PRESCALE*16+1) clock cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_4</name>
                  <description>(PRESCALE*16+1) clock cycles</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_5</name>
                  <description>(PRESCALE*16+1) clock cycles</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_6</name>
                  <description>(PRESCALE*16+1) clock cycles</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_7</name>
                  <description>(PRESCALE*16+1) clock cycles</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_8</name>
                  <description>(PRESCALE*16+1) clock cycles</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_9</name>
                  <description>(PRESCALE*16+1) clock cycles</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT</name>
              <description>Refresh timer period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT_0</name>
                  <description>(256+1)*(Prescaler period)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_1</name>
                  <description>(RT+1)*(Prescaler period)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_2</name>
                  <description>(RT+1)*(Prescaler period)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_3</name>
                  <description>(RT+1)*(Prescaler period)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_4</name>
                  <description>(RT+1)*(Prescaler period)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_5</name>
                  <description>(RT+1)*(Prescaler period)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_6</name>
                  <description>(RT+1)*(Prescaler period)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_7</name>
                  <description>(RT+1)*(Prescaler period)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_8</name>
                  <description>(RT+1)*(Prescaler period)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_9</name>
                  <description>(RT+1)*(Prescaler period)</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UT</name>
              <description>Urgent refresh threshold</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UT_0</name>
                  <description>256*(Prescaler period)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_1</name>
                  <description>UT*(Prescaler period)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_2</name>
                  <description>UT*(Prescaler period)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_3</name>
                  <description>UT*(Prescaler period)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_4</name>
                  <description>UT*(Prescaler period)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_5</name>
                  <description>UT*(Prescaler period)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_6</name>
                  <description>UT*(Prescaler period)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_7</name>
                  <description>UT*(Prescaler period)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_8</name>
                  <description>UT*(Prescaler period)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_9</name>
                  <description>UT*(Prescaler period)</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
