mkj/imxrt-pacs/svd/MIMXRT1042.svd
        <register>
          <name>CH2OPTS_SET</name>
          <description>DCP channel 2 options register</description>
          <addressOffset>0x1B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECOVERY_TIMER</name>
              <description>This field indicates the recovery time for the channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2OPTS_CLR</name>
          <description>DCP channel 2 options register</description>
          <addressOffset>0x1B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECOVERY_TIMER</name>
              <description>This field indicates the recovery time for the channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2OPTS_TOG</name>
          <description>DCP channel 2 options register</description>
          <addressOffset>0x1BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECOVERY_TIMER</name>
              <description>This field indicates the recovery time for the channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3CMDPTR</name>
          <description>DCP channel 3 command pointer address register</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Pointer to the descriptor structure to be processed for channel 3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3SEMA</name>
          <description>DCP channel 3 semaphore register</description>
          <addressOffset>0x1D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INCREMENT</name>
              <description>The value written to this field is added to the semaphore count in an atomic way, such that the simultaneous software adds and DCP hardware substracts happening on the same clock are protected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>This read-only field shows the current (instantaneous) value of the semaphore counter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3STAT</name>
          <description>DCP channel 3 status register</description>
          <addressOffset>0x1E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HASH_MISMATCH</name>
              <description>This bit indicates that a hashing check operation is mismatched for the control packets that enable the HASH_CHECK bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SETUP</name>
              <description>This bit indicates that the hardware detected an invalid programming configuration (such as a buffer length that is not a multiple of the natural data size for the operation)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PACKET</name>
              <description>This bit indicates that a bus error occurred when reading the packet or payload or when writing the status back to the packet paylaod</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SRC</name>
              <description>This bit indicates that a bus error occurred when reading from the source buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_DST</name>
              <description>This bit indicates that a bus error occurred when storing to the destination buffer</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PAGEFAULT</name>
              <description>This bit indicates that a page fault occurred while converting a virtual address to a physical address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_CODE</name>
              <description>Indicates additional error codes for some of the error conditions.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEXT_CHAIN_IS_0</name>
                  <description>Error is signalled because the next pointer is 0x00000000.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CHAIN</name>
                  <description>Error is signalled because the semaphore is of a non-zero value and neither of the chain bits is set.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTEXT_ERROR</name>
                  <description>Error is signalled because an error was reported while reading/writing the context buffer.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_ERROR</name>
                  <description>Error is signalled because an error was reported while reading/writing the payload.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_MODE</name>
                  <description>Error is signalled because the control packet specifies an invalid mode select (for example, blit + hash).</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAG</name>
              <description>Indicates the tag from the last completed packet in the command structure.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3STAT_SET</name>
          <description>DCP channel 3 status register</description>
          <addressOffset>0x1E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HASH_MISMATCH</name>
              <description>This bit indicates that a hashing check operation is mismatched for the control packets that enable the HASH_CHECK bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SETUP</name>
              <description>This bit indicates that the hardware detected an invalid programming configuration (such as a buffer length that is not a multiple of the natural data size for the operation)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PACKET</name>
              <description>This bit indicates that a bus error occurred when reading the packet or payload or when writing the status back to the packet paylaod</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SRC</name>
              <description>This bit indicates that a bus error occurred when reading from the source buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_DST</name>
              <description>This bit indicates that a bus error occurred when storing to the destination buffer</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PAGEFAULT</name>
              <description>This bit indicates that a page fault occurred while converting a virtual address to a physical address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_CODE</name>
              <description>Indicates additional error codes for some of the error conditions.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEXT_CHAIN_IS_0</name>
                  <description>Error is signalled because the next pointer is 0x00000000.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CHAIN</name>
                  <description>Error is signalled because the semaphore is of a non-zero value and neither of the chain bits is set.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTEXT_ERROR</name>
                  <description>Error is signalled because an error was reported while reading/writing the context buffer.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_ERROR</name>
                  <description>Error is signalled because an error was reported while reading/writing the payload.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_MODE</name>
                  <description>Error is signalled because the control packet specifies an invalid mode select (for example, blit + hash).</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAG</name>
              <description>Indicates the tag from the last completed packet in the command structure.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3STAT_CLR</name>
          <description>DCP channel 3 status register</description>
          <addressOffset>0x1E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HASH_MISMATCH</name>
              <description>This bit indicates that a hashing check operation is mismatched for the control packets that enable the HASH_CHECK bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SETUP</name>
              <description>This bit indicates that the hardware detected an invalid programming configuration (such as a buffer length that is not a multiple of the natural data size for the operation)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PACKET</name>
              <description>This bit indicates that a bus error occurred when reading the packet or payload or when writing the status back to the packet paylaod</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SRC</name>
              <description>This bit indicates that a bus error occurred when reading from the source buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_DST</name>
              <description>This bit indicates that a bus error occurred when storing to the destination buffer</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PAGEFAULT</name>
              <description>This bit indicates that a page fault occurred while converting a virtual address to a physical address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_CODE</name>
              <description>Indicates additional error codes for some of the error conditions.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEXT_CHAIN_IS_0</name>
                  <description>Error is signalled because the next pointer is 0x00000000.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CHAIN</name>
                  <description>Error is signalled because the semaphore is of a non-zero value and neither of the chain bits is set.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTEXT_ERROR</name>
                  <description>Error is signalled because an error was reported while reading/writing the context buffer.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_ERROR</name>
                  <description>Error is signalled because an error was reported while reading/writing the payload.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_MODE</name>
                  <description>Error is signalled because the control packet specifies an invalid mode select (for example, blit + hash).</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAG</name>
              <description>Indicates the tag from the last completed packet in the command structure.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3STAT_TOG</name>
          <description>DCP channel 3 status register</description>
          <addressOffset>0x1EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HASH_MISMATCH</name>
              <description>This bit indicates that a hashing check operation is mismatched for the control packets that enable the HASH_CHECK bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SETUP</name>
              <description>This bit indicates that the hardware detected an invalid programming configuration (such as a buffer length that is not a multiple of the natural data size for the operation)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PACKET</name>
              <description>This bit indicates that a bus error occurred when reading the packet or payload or when writing the status back to the packet paylaod</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SRC</name>
              <description>This bit indicates that a bus error occurred when reading from the source buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_DST</name>
              <description>This bit indicates that a bus error occurred when storing to the destination buffer</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PAGEFAULT</name>
              <description>This bit indicates that a page fault occurred while converting a virtual address to a physical address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_CODE</name>
              <description>Indicates additional error codes for some of the error conditions.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEXT_CHAIN_IS_0</name>
                  <description>Error is signalled because the next pointer is 0x00000000.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CHAIN</name>
                  <description>Error is signalled because the semaphore is of a non-zero value and neither of the chain bits is set.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTEXT_ERROR</name>
                  <description>Error is signalled because an error was reported while reading/writing the context buffer.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_ERROR</name>
                  <description>Error is signalled because an error was reported while reading/writing the payload.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_MODE</name>
                  <description>Error is signalled because the control packet specifies an invalid mode select (for example, blit + hash).</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAG</name>
              <description>Indicates the tag from the last completed packet in the command structure.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3OPTS</name>
          <description>DCP channel 3 options register</description>
          <addressOffset>0x1F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECOVERY_TIMER</name>
              <description>This field indicates the recovery time for the channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
